{"mainPhotoUrl":"photo_2.jpg","mainIndoorPhotoUrl":"photo_9.jpg","mainOutdoorPhotoUrl":"photo_2.jpg","indoorPhotoUrls":["photo_9.jpg","photo_7.jpg","photo_8.jpg","photo_10.jpg","photo_11.jpg","photo_12.jpg","photo_13.jpg","photo_14.jpg","photo_15.jpg","photo_16.jpg","photo_17.jpg"],"outdoorPhotoUrls":["photo_2.jpg","photo_0.jpg","photo_3.jpg","photo_1.jpg","photo_5.jpg","photo_6.jpg","photo_4.jpg"],"photoList":[{"colors":"blue, green, beige, gray, white","description":"Discover your perfect vacation oasis featuring a sparkling pool, relaxing hot tub, and inviting lounge chairs surrounded by lush greenery. This outdoor space is ideal for sunbathing, swimming, and enjoying quality time with family and friends in a serene setting.","indoorOrOutdoor":"outdoor","objects":"pool, hot tub, lounge chairs, patio furniture, grass, palm trees, fence, house","roomOrOutdoorFeature":"swimming pool area","url":"","fileName":"photo_2.jpg"},{"colors":"white, gray, green, black","description":"Step into this modern and inviting vacation rental, where contemporary elegance meets homey comfort. Enjoy meals in the stylish dining area, unwind on the chic couch, and admire the vibrant artwork that adds a splash of personality to the space. Perfect for families or groups seeking a memorable getaway.","indoorOrOutdoor":"indoor","objects":"kitchen counter, stools, dining table, chairs, couch, painting, flowers","roomOrOutdoorFeature":"living room and kitchen area","url":"","fileName":"photo_9.jpg"},{"colors":"green, beige, blue, brown, white","description":"Welcome to your serene escape! This charming rental features an inviting entrance with elegant columns, vibrant greenery, and a cozy brick pathway, perfect for relaxing afternoons. Enjoy the blend of contemporary design and natural beauty, making it an ideal getaway.","indoorOrOutdoor":"outdoor","objects":"house, door, windows, columns, plants, bricks, walkway","roomOrOutdoorFeature":"entrance area","url":"","fileName":"photo_0.jpg"},{"colors":"green, blue, gray, white, brown","description":"Experience the perfect vacation getaway in this charming rental, featuring a lush garden, a refreshing swimming pool, and ample parking. Nestled in a quiet neighborhood, it offers a serene escape while being just minutes away from nearby attractions and amenities.","indoorOrOutdoor":"outdoor","objects":"houses, trees, swimming pool, cars, pavement","roomOrOutdoorFeature":"swimming pool","url":"","fileName":"photo_3.jpg"},{"colors":"green, blue, brown, gray","description":"Escape to your tropical oasis in this charming vacation rental, featuring lush palm trees and a beautifully paved driveway, perfect for relaxing or exploring nearby attractions.","indoorOrOutdoor":"outdoor","objects":"house, palm trees, driveway, shrubs, car","roomOrOutdoorFeature":"outdoor feature","url":"","fileName":"photo_1.jpg"},{"colors":"blue, green, white","description":"Experience ultimate relaxation in this beautiful vacation rental featuring a stunning pool surrounded by lush greenery and comfortable lounge chairs. Perfect for sunbathing, swimming, and enjoying the serene atmosphere!","indoorOrOutdoor":"outdoor","objects":"pool, lounge chairs, trees, fencing, patio","roomOrOutdoorFeature":"pool area","url":"","fileName":"photo_5.jpg"},{"colors":"blue, green, beige, white, brown","description":"Discover your own slice of paradise in this stunning vacation rental featuring a sparkling pool and relaxing jacuzzi, surrounded by lush palm trees. Enjoy sunny days lounging on the patio or taking a dip in the refreshing waters. This outdoor oasis is perfect for families and friends alike, offering both tranquility and fun under the sun.","indoorOrOutdoor":"outdoor","objects":"pool, jacuzzi, lounge chair, house, palm trees, patio","roomOrOutdoorFeature":"outdoor pool area","url":"","fileName":"photo_6.jpg"},{"colors":"blue, green, white","description":"Step into this bright and inviting living space, perfect for relaxation and enjoyment with family and friends. Featuring modern furnishings and expansive views of the sparkling pool, this vacation rental promises a serene escape.","indoorOrOutdoor":"indoor","objects":"sofa, pillows, curtains, sliding doors, pool, lawn","roomOrOutdoorFeature":"living room","url":"","fileName":"photo_7.jpg"},{"colors":"white, gray, yellow, black","description":"Discover a refreshing escape in this beautifully designed bathroom, featuring elegant marble tiles and a cheerful floral shower curtain that brightens the space. Ideal for guests seeking comfort and modern amenities during their stay.","indoorOrOutdoor":"indoor","objects":"bathtub, shower curtain, toilet, mirror, vanity, towel holder","roomOrOutdoorFeature":"bathroom","url":"","fileName":"photo_8.jpg"},{"colors":"blue, green, white, beige","description":"Experience the ultimate relaxation in this stunning vacation rental featuring a pristine swimming pool surrounded by lush greenery and comfortable lounge chairs. Perfect for sunbathing and entertaining, the outdoor space promises tranquility and fun. Enjoy the spacious patio and the inviting ambiance of your home away from home.","indoorOrOutdoor":"outdoor","objects":"swimming pool, lounge chairs, house, patio, palm trees, grass","roomOrOutdoorFeature":"swimming pool area","url":"","fileName":"photo_4.jpg"},{"colors":"blue, white, beige, gray","description":"Experience comfort and tranquility in this beautifully designed vacation rental bedroom, featuring modern furnishings and a serene ambiance perfect for relaxation. The striking blue bedding complements the soft beige walls, while the decorative painting adds a touch of elegance. Enjoy the convenience of an ensuite bathroom just steps away.","indoorOrOutdoor":"indoor","objects":"bed, nightstand, lamp, painting, mirror, bathroom door, toilet, shower curtain","roomOrOutdoorFeature":"bedroom","url":"","fileName":"photo_10.jpg"},{"colors":"white, gray, blue, pink, green","description":"Experience a rejuvenating stay in this modern bathroom, featuring stylish fixtures, a vibrant shower curtain, and natural light pouring in through the window. Perfect for unwinding after a long day of exploration.","indoorOrOutdoor":"indoor","objects":"mirror, shower curtain, showerhead, sink, toilet, window, plant, wall","roomOrOutdoorFeature":"bathroom","url":"","fileName":"photo_11.jpg"},{"colors":"black, white, gray","description":"Experience contemporary elegance in this chic bathroom, featuring sleek black tiles and a modern vanity. Perfectly designed for relaxation and convenience, it combines style and functionality for your everyday needs.","indoorOrOutdoor":"indoor","objects":"toilet, shower, sink, mirror, cabinet, towel","roomOrOutdoorFeature":"bathroom","url":"","fileName":"photo_12.jpg"},{"colors":"blue, white, gray, beige","description":"Experience tranquility in this beautifully designed bedroom, perfect for relaxation after a day of adventure. Featuring a comfortable bed adorned with plush pillows, stylish furnishings, and a serene view of nature, this room is an inviting retreat that embodies comfort and modern elegance.","indoorOrOutdoor":"indoor","objects":"bed, pillows, nightstand, lamp, painting, television, shelves, window blinds","roomOrOutdoorFeature":"bedroom","url":"","fileName":"photo_13.jpg"},{"colors":"white, gray, beige","description":"Welcome to this modern and spacious kitchen, perfect for culinary adventures during your stay. Featuring sleek white cabinetry, a stainless steel refrigerator, and a convenient coffee maker, this space is designed for both functionality and style. Enjoy the elegant granite countertops and ample natural light, making it an inviting place to gather and create delicious meals.","indoorOrOutdoor":"indoor","objects":"kitchen cabinets, refrigerator, microwave, coffee maker, sink, countertop, fire extinguisher","roomOrOutdoorFeature":"kitchen","url":"","fileName":"photo_14.jpg"},{"colors":"white, gray, green","description":"Experience tranquility in this bright, airy workspace featuring a modern desk and comfortable seating. The large window brings in natural light, while the lush greenery outside adds a refreshing touch. Ideal for remote work or relaxation between your vacation adventures.","indoorOrOutdoor":"indoor","objects":"desk, chair, window, blinds, wall, floor, white shelf","roomOrOutdoorFeature":"workspace","url":"","fileName":"photo_15.jpg"},{"colors":"white, gray, black, beige, green","description":"Experience modern elegance in this stylish vacation rental kitchen. The spacious layout features sleek white cabinetry, a high-end stainless steel refrigerator, and a contemporary dining area perfect for gathering with loved ones. Natural light pours in through the large windows, enhancing the inviting atmosphere. Enjoy the finer things in life during your stay!","indoorOrOutdoor":"indoor","objects":"kitchen cabinets, refrigerator, stove, dining table, chairs, countertop, window, wall art, plant","roomOrOutdoorFeature":"kitchen","url":"","fileName":"photo_16.jpg"},{"colors":"white, gray, green, blue, yellow","description":"Welcome to your tranquil kitchen oasis, perfect for culinary delights and gatherings with loved ones. This stylish vacation rental features modern finishes, sleek bar stools, and a charming outdoor view, making it the ideal spot to create unforgettable memories.","indoorOrOutdoor":"indoor","objects":"table, chairs, vase, flowers, kitchen cabinets, refrigerator, countertop, microwave, fire extinguisher, sliding door, outdoor view, bar stools","roomOrOutdoorFeature":"kitchen","url":"","fileName":"photo_17.jpg"}],"indoorPhotoUrlsMap":{"living room and kitchen area":["photo_9.jpg"],"living room":["photo_7.jpg"],"bathroom":["photo_8.jpg","photo_11.jpg","photo_12.jpg"],"bedroom":["photo_10.jpg","photo_13.jpg"],"kitchen":["photo_14.jpg","photo_16.jpg","photo_17.jpg"],"workspace":["photo_15.jpg"]}}